<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"7804b28c741c4a948fd4af3353b872417533f1dde32e92aba652e2ff90ae8f78","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #713 at https://github.com/cal-itp/data-infra/actions/runs/18024605070","plan_out_hash":"df0875f8eb0cd6f1eaad1275cba2c86c755e47e633b0689614fffd63a9256099","plan_hash":"23bdcbedcefd9e73c7f797010b12acbb31ab21bdd013b79306b4e0680a08185c","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 2 to add, 19 to change, 2 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/METADATA.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "LfBziQ==" -> (known after apply)
!~      detect_md5hash      = "hNEtdmodcS7FxF5yKvOrjQ==" -> "different hash"
!~      generation          = 1756151436484319 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/METADATA.yml"
!~      md5hash             = "hNEtdmodcS7FxF5yKvOrjQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/METADATA.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/airtable_california_transit.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "fzj1Ug==" -> (known after apply)
!~      detect_md5hash      = "2/Nzp//zkOjvMifYuahULw==" -> "different hash"
!~      generation          = 1756320680485764 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/airtable_california_transit.yml"
!~      md5hash             = "2/Nzp//zkOjvMifYuahULw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_california_transit.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "l4rvdg==" -> (known after apply)
!~      detect_md5hash      = "UUhjnhbTrfQpzjee3xW66Q==" -> "different hash"
!~      generation          = 1756320680915909 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
!~      md5hash             = "UUhjnhbTrfQpzjee3xW66Q==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_transit_data_quality_issues.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "9v6Xdg==" -> (known after apply)
!~      detect_md5hash      = "lDIqkg2sJkIRvaJDlsOW6Q==" -> "different hash"
!~      generation          = 1756320680467926 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
!~      md5hash             = "lDIqkg2sJkIRvaJDlsOW6Q==" -> (known after apply)
        name                = "dags/copy_production_to_staging/airtable_transit_technology_stacks.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/display_copy_date.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/display_copy_date.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/display_copy_date.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "+bibYA==" -> (known after apply)
!~      detect_md5hash      = "ulgSLsT0xxRxmhCjpMuV+A==" -> "different hash"
!~      generation          = 1756320680468549 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
!~      md5hash             = "ulgSLsT0xxRxmhCjpMuV+A==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_aggregator_scrape_results.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "eiLxbA==" -> (known after apply)
!~      detect_md5hash      = "TRdIpvI/tpiR1uR+4K4lMg==" -> "different hash"
!~      generation          = 1756320680916935 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
!~      md5hash             = "TRdIpvI/tpiR1uR+4K4lMg==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "5FP1pg==" -> (known after apply)
!~      detect_md5hash      = "kxmE/SoEDQzxoz2K/cLKXw==" -> "different hash"
!~      generation          = 1756320681387283 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
!~      md5hash             = "kxmE/SoEDQzxoz2K/cLKXw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "ZEDP2w==" -> (known after apply)
!~      detect_md5hash      = "HyEm4wuK2+BZTacwtnwdjQ==" -> "different hash"
!~      generation          = 1756320680478498 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
!~      md5hash             = "HyEm4wuK2+BZTacwtnwdjQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_parsed_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "5Tta5g==" -> (known after apply)
!~      detect_md5hash      = "FmeHe1eYu4jXQFCcLXrEDw==" -> "different hash"
!~      generation          = 1756320680492947 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
!~      md5hash             = "FmeHe1eYu4jXQFCcLXrEDw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "Qn06XQ==" -> null
-       detect_md5hash      = "Q/qoLB9FLAZhrmiY/IB+fQ==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756320680615373 -> null
-       id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml" -> null
-       md5hash             = "Q/qoLB9FLAZhrmiY/IB+fQ==" -> null
-       md5hexhash          = "43faa82c1f452c0661ae6898fc807e7d" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_rt_schedule_parsed_txt_results.yml?generation=1756320680615373&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml" -> null
-       output_name         = "dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_rt_schedule_parsed_txt_results.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/gtfs_rt_schedule_parsed_txt_results.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "XtTfrA==" -> (known after apply)
!~      detect_md5hash      = "sj23E4LWoyYLDxVgnadLyw==" -> "different hash"
!~      generation          = 1756320680172516 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
!~      md5hash             = "sj23E4LWoyYLDxVgnadLyw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_service_alerts.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "yFpYKw==" -> (known after apply)
!~      detect_md5hash      = "82MQP6x3O0P3p8hV5QGRmQ==" -> "different hash"
!~      generation          = 1756320681344195 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
!~      md5hash             = "82MQP6x3O0P3p8hV5QGRmQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_trip_updates.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "hQBa1g==" -> (known after apply)
!~      detect_md5hash      = "YGHDf9lgFHlS7R8dwcKFYA==" -> "different hash"
!~      generation          = 1756320681048858 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
!~      md5hash             = "YGHDf9lgFHlS7R8dwcKFYA==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_rt_validation_vehicle_positions.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule.yml"] will be created
+   resource "google_storage_bucket_object" "calitp-composer" {
+       bucket         = "calitp-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "dags/copy_production_to_staging/gtfs_schedule.yml"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule.yml"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "zlAQtg==" -> (known after apply)
!~      detect_md5hash      = "P1aXLxp2SEBZCRWLosKymw==" -> "different hash"
!~      generation          = 1756320681376978 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
!~      md5hash             = "P1aXLxp2SEBZCRWLosKymw==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_download_configs.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"] will be destroyed
  # (because key ["dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml"] is not in for_each map)
-   resource "google_storage_bucket_object" "calitp-composer" {
-       bucket              = "calitp-composer" -> null
-       content_type        = "text/plain; charset=utf-8" -> null
-       crc32c              = "tRUQ1g==" -> null
-       detect_md5hash      = "uZlRUa92ovWjn7qSgWnv/A==" -> null
-       event_based_hold    = false -> null
-       generation          = 1756320681384198 -> null
-       id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml" -> null
-       md5hash             = "uZlRUa92ovWjn7qSgWnv/A==" -> null
-       md5hexhash          = "b9995151af76a2f5a39fba928169effc" -> null
-       media_link          = "https://storage.googleapis.com/download/storage/v1/b/calitp-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule_download_outcomes.yml?generation=1756320681384198&alt=media" -> null
-       metadata            = {} -> null
-       name                = "dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml" -> null
-       output_name         = "dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml" -> null
-       self_link           = "https://www.googleapis.com/storage/v1/b/calitp-composer/o/dags%2Fcopy_production_to_staging%2Fgtfs_schedule_download_outcomes.yml" -> null
-       source              = "../../../../airflow/dags/copy_production_to_staging/gtfs_schedule_download_outcomes.yml" -> null
-       storage_class       = "STANDARD" -> null
-       temporary_hold      = false -> null
#        (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "B1U36w==" -> (known after apply)
!~      detect_md5hash      = "Qf/BHlDA2DgKJsf3afpN3w==" -> "different hash"
!~      generation          = 1756320681357908 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
!~      md5hash             = "Qf/BHlDA2DgKJsf3afpN3w==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_unzip_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "epCD4A==" -> (known after apply)
!~      detect_md5hash      = "QSY/WlG9MRkPcQ2TPwLSYg==" -> "different hash"
!~      generation          = 1756320680479986 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
!~      md5hash             = "QSY/WlG9MRkPcQ2TPwLSYg==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_validation_notices.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "Crum7A==" -> (known after apply)
!~      detect_md5hash      = "aAG1T5BvF9b9fBiotXiI+A==" -> "different hash"
!~      generation          = 1756320680487377 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
!~      md5hash             = "aAG1T5BvF9b9fBiotXiI+A==" -> (known after apply)
        name                = "dags/copy_production_to_staging/gtfs_schedule_validation_outcomes.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer["dags/copy_production_to_staging/state_highway_network.yml"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer" {
!~      crc32c              = "/CUzrA==" -> (known after apply)
!~      detect_md5hash      = "lS+vKQZuqQwmRm/2YIPWLQ==" -> "different hash"
!~      generation          = 1756320681049770 -> (known after apply)
        id                  = "calitp-composer-dags/copy_production_to_staging/state_highway_network.yml"
!~      md5hash             = "lS+vKQZuqQwmRm/2YIPWLQ==" -> (known after apply)
        name                = "dags/copy_production_to_staging/state_highway_network.yml"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "ZofoqQ==" -> (known after apply)
!~      detect_md5hash      = "VnE3wKeVgjHaIQwi/whD0g==" -> "different hash"
!~      generation          = 1758764038141917 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "VnE3wKeVgjHaIQwi/whD0g==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "byI+2A==" -> (known after apply)
!~      detect_md5hash      = "8aNFBYU2bQeHg78aUIUV7w==" -> "different hash"
!~      generation          = 1758764039901527 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "8aNFBYU2bQeHg78aUIUV7w==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 2 to add, 19 to change, 2 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #713](https://github.com/cal-itp/data-infra/actions/runs/18024605070)